DS/src/Documents/Абонемент/Абонемент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Абонемент</name>
  <registerRecords>InformationRegister.СтатусыАбонементов</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПосещений</registerRecords>
  <attributes>
    <name>Человек</name>
    <type>
      <types>CatalogRef.Люди</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАбонемента</name>
    <type>
      <types>CatalogRef.ВидыАбонементов</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>DocumentRef.Курс</types>
    </type>
  </attributes>
</mdclass:Document>

DS/src/InformationRegisters/СтатусыАбонементов/СтатусыАбонементов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыАбонементов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыАбонементов</types>
    </type>
  </resources>
  <dimensions>
    <name>Абонемент</name>
    <type>
      <types>DocumentRef.Абонемент</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

DS/src/AccumulationRegisters/ОстаткиПосещений/ОстаткиПосещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПосещений</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Абонемент</name>
    <type>
      <types>DocumentRef.Абонемент</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

DS/src/Enums/СтатусыАбонементов/СтатусыАбонементов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыАбонементов</name>
  <enumValues>
    <name>НеАктивирован</name>
  </enumValues>
  <enumValues>
    <name>Активирован</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

DS/src/Documents/Абонемент/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.СтатусыАбонементов.Записывать = Истина;
	Движения.ОстаткиПосещений.Записывать = Истина;
	
	Запись = Движения.СтатусыАбонементов.Добавить();
	Запись.Абонемент = Ссылка;
	Запись.Период = НачалоДня(Дата);
	Запись.Статус = Перечисления.СтатусыАбонементов.НеАктивирован;
	
	Если ВидАбонемента.КоличествоЗанятий Тогда
		
		Запись = Движения.ОстаткиПосещений.ДобавитьПриход();
		Запись.Период = Дата;
		Запись.Абонемент = Ссылка;
		Запись.Количество = ВидАбонемента.КоличествоЗанятий;
		
	КонецЕсли;

КонецПроцедуры
